# ReferenceViewerTargetView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceViewerTargetView Property
ParameterTypeId Class See Also
---
"Target view"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceViewerTargetView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceViewerTargetView As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceViewerTargetView {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace